app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 123]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def find_same_director
    @movie = Movie.find(params[:id])
    if @movie.director.nil? or @movie.director.empty?

UPDATE "movies" SET "director" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["director", "Ridley Scott"], ["updated_at", "2019-10-13 22:55:55.486538"], ["id", 3]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)